In [1]:
import json
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [19]:
obj="""
{"name":"Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet":null,
"siblings": [{"name":"Kim", "age":25, "pets":["ba", "ka"]}, 
             {"name":"Lee", "age":22, "pets":["aa","bb","cc"]}] 
}
"""
print(obj)

{"name":"Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet":null,
"siblings": [{"name":"Kim", "age":25, "pets":["ba", "ka"]},
             {"name":"Lee", "age":22, "pets":["aa","bb","cc"]}]
}

In [20]:
res=json.loads(obj)
res

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Kim', 'age': 25, 'pets': ['ba', 'ka']},
  {'name': 'Lee', 'age': 22, 'pets': ['aa', 'bb', 'cc']}]}

In [22]:
asjson=json.dumps(res)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Kim", "age": 25, "pets": ["ba", "ka"]}, {"name": "Lee", "age": 22, "pets": ["aa", "bb", "cc"]}]}'

In [23]:
res['siblings']

[{'name': 'Kim', 'age': 25, 'pets': ['ba', 'ka']},
 {'name': 'Lee', 'age': 22, 'pets': ['aa', 'bb', 'cc']}]

In [24]:
df=pd.DataFrame(res['siblings'], columns=['name','age'])

In [25]:
df.to_json("myjson.json")

In [26]:
pd.read_json("myjson.json")

  name  age
0  Kim   25
1  Lee   22

In [27]:
stringData=pd.Series(['aaa','bbb', np.nan,'ccc'])
stringData
stringData.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [28]:
stringData[0]=None
stringData.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [29]:
from numpy import nan
data=pd.Series([1, nan, 3.5, nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [30]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
data=pd.DataFrame([[1,6,3],[1, nan, nan],[nan,nan, nan],[nan,5,2]])
data

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  5.0  2.0

In [32]:
data.dropna()

     0    1    2
0  1.0  6.0  3.0

In [33]:
data.dropna(how='all') #모두 nan인 경우만 제외

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
3  NaN  5.0  2.0

In [36]:
data=pd.DataFrame({'a':['one','two']*3+['two'], 'b':[1,1,2,3,3,4,4]})
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
a    7 non-null object
b    7 non-null int64
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data['v1']=range(7)
data

     a  b  v1
0  one  1   0
1  two  1   1
2  one  2   2
3  two  3   3
4  one  3   4
5  two  4   5
6  two  4   6

In [42]:
data.drop_duplicates(['a', 'b'], keep='last')

     a  b  v1
0  one  1   0
1  two  1   1
2  one  2   2
3  two  3   3
4  one  3   4
6  two  4   6

In [44]:
ages=[15,20,25,28,30,20,22,37,61,44,46,33]
bins=[10,20,30,40,60,100]
res=pd.cut(ages, bins)

In [45]:
res.codes

array([0, 0, 1, 1, 1, 0, 1, 2, 4, 3, 3, 2], dtype=int8)

In [46]:
res.categories

IntervalIndex([(10, 20], (20, 30], (30, 40], (40, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [47]:
res.value_counts()

(10, 20]     3
(20, 30]     4
(30, 40]     2
(40, 60]     2
(60, 100]    1
dtype: int64

In [48]:
gn=['youth','youngyouth','middleaged','senior']
pd.cut(ages, [15,26,36,61,100], labels=gn)

[NaN, youth, youth, youngyouth, youngyouth, ..., middleaged, middleaged, middleaged, middleaged, youngyouth]
Length: 12
Categories (4, object): [youth < youngyouth < middleaged < senior]

In [49]:
res=pd.qcut(ages,4)
res

[(14.999, 21.5], (14.999, 21.5], (21.5, 29.0], (21.5, 29.0], (29.0, 38.75], ..., (29.0, 38.75], (38.75, 61.0], (38.75, 61.0], (38.75, 61.0], (29.0, 38.75]]
Length: 12
Categories (4, interval[float64]): [(14.999, 21.5] < (21.5, 29.0] < (29.0, 38.75] < (38.75, 61.0]]

In [50]:
res.value_counts()

(14.999, 21.5]    3
(21.5, 29.0]      3
(29.0, 38.75]     3
(38.75, 61.0]     3
dtype: int64

In [63]:
abalone=pd.read_csv("abalone.txt", header=None, names=['sex','length','diameter','height','whole_weight','shucked_sweight','viscera_weight','shell_weight','rings'])
abalone

,sex,length,diameter,height,whole_weight,shucked_sweight,viscera_weight,shell_weight,rings
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.1500,15
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.0700,7
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.2100,9
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.1550,10
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.0550,7
...,...,...,...,...,...,...,...,...,...
4172,F,0.565,0.450,0.165,0.8870,0.3700,0.2390,0.2490,11
4173,M,0.590,0.440,0.135,0.9660,0.4390,0.2145,0.2605,10
4174,M,0.600,0.475,0.205,1.1760,0.5255,0.2875,0.3080,9
4175,F,0.625,0.485,0.150,1.0945,0.5310,0.2610,0.2960,10
4176,M,0.710,0.555,0.195,1.9485,0.9455,0.3765,0.4950,12

In [55]:
abalone.isnull().sum()

sex                0
length             0
diameter           0
height             0
whole_weight       0
shucked_sweight    0
viscera_weight     0
shell_weight       0
rings              0
dtype: int64

In [58]:
grouped=abalone['whole_weight'].groupby(abalone['sex'])
grouped.size()

sex
F    1307
I    1342
M    1528
Name: whole_weight, dtype: int64

In [75]:
length_mean=abalone.length.mean()
abalone['length_med']=abalone['length']>length_mean
abalone['length_med']=np.where(abalone['length_med']==True, 'length_long', 'length_short')
pd.DataFrame([abalone['length'],abalone['length_med']]).T

     length    length_med
0     0.455  length_short
1      0.35  length_short
2      0.53   length_long
3      0.44  length_short
4      0.33  length_short
...     ...           ...
4172  0.565   length_long
4173   0.59   length_long
4174    0.6   length_long
4175  0.625   length_long
4176   0.71   length_long

[4177 rows x 2 columns]

In [77]:
mean_weight=abalone['whole_weight'].groupby([abalone['sex'], abalone['length_med']]).mean()
mean_weight.unstack()

length_med  length_long  length_short
sex
F              1.215354      0.523661
I              0.848975      0.320760
M              1.206868      0.472172

In [78]:
abalone[['sex','length_med','whole_weight','rings']].groupby('sex')

In [79]:
for sex, group_data in abalone[['sex','length_med','whole_weight','rings']].groupby('sex'):
    print(sex), print(group_data[:5])

F
   sex   length_med  whole_weight  rings
2    F  length_long        0.6770      9
6    F  length_long        0.7775     20
7    F  length_long        0.7680     16
9    F  length_long        0.8945     19
10   F  length_long        0.6065     14
I
   sex    length_med  whole_weight  rings
4    I  length_short        0.2050      7
5    I  length_short        0.3515      8
16   I  length_short        0.2905      7
21   I  length_short        0.2255     10
42   I  length_short        0.0700      5
M
   sex    length_med  whole_weight  rings
0    M  length_short        0.5140     15
1    M  length_short        0.2255      7
3    M  length_short        0.5160     10
8    M  length_short        0.5095      9
11   M  length_short        0.4060     10

In [82]:
for (sex, length_med), group_data in abalone[['sex','length_med','whole_weight','rings']].groupby(['sex', 'length_med']):
    print(sex, length_med), print(group_data[:5])

F length_long
   sex   length_med  whole_weight  rings
2    F  length_long        0.6770      9
6    F  length_long        0.7775     20
7    F  length_long        0.7680     16
9    F  length_long        0.8945     19
10   F  length_long        0.6065     14
F length_short
   sex    length_med  whole_weight  rings
14   F  length_short        0.4755     10
17   F  length_short        0.4510     10
37   F  length_short        0.5225      8
40   F  length_short        0.4250      9
47   F  length_short        0.4605      7
I length_long
    sex   length_med  whole_weight  rings
509   I  length_long        0.8735     16
510   I  length_long        1.1095     10
530   I  length_long        0.7520     20
549   I  length_long        0.8750     11
550   I  length_long        1.1625     17
I length_short
   sex    length_med  whole_weight  rings
4    I  length_short        0.2050      7
5    I  length_short        0.3515      8
16   I  length_short        0.2905      7
21   I  length_short        0.2255     10
42   I  length_short        0.0700      5
M length_long
   sex   length_med  whole_weight  rings
27   M  length_long        0.9310     12
28   M  length_long        0.9365     15
29   M  length_long        0.8635     11
30   M  length_long        0.9975     10
32   M  length_long        1.3380     18
M length_short
   sex    length_med  whole_weight  rings
0    M  length_short        0.5140     15
1    M  length_short        0.2255      7
3    M  length_short        0.5160     10
8    M  length_short        0.5095      9
11   M  length_short        0.4060     10

In [85]:
aba_group=dict(list(abalone[:10][['sex','length_med','whole_weight','rings']].groupby('sex')))

In [86]:
aba_group['M']

  sex    length_med  whole_weight  rings
0   M  length_short        0.5140     15
1   M  length_short        0.2255      7
3   M  length_short        0.5160     10
8   M  length_short        0.5095      9

In [87]:
df=pd.DataFrame({'name':['kim','KIM','Kim','lee','LEE','Lee','cho','choi'],
                'value1':[1,2,3,4,5,6,7,8],
                'value2':[100,200,300,100,200,100,300,500]})
df

   name  value1  value2
0   kim       1     100
1   KIM       2     200
2   Kim       3     300
3   lee       4     100
4   LEE       5     200
5   Lee       6     100
6   cho       7     300
7  choi       8     500

In [88]:
nameMapping={"KIM":"kim", "Kim":"kim", "LEE":"lee", "Lee":"lee", "cho":"others", "chol":"others"}

In [91]:
func=lambda x:nameMapping.get(x, x)

In [93]:
df['name2']=df.name.map(func)

In [94]:
df.groupby('name2').sum()

        value1  value2
name2
choi         8     500
kim          6     600
lee         15     400
others       7     300

In [95]:
df.groupby(['name2', 'name']).sum()

             value1  value2
name2  name
choi   choi       8     500
kim    KIM        2     200
       Kim        3     300
       kim        1     100
lee    LEE        5     200
       Lee        6     100
       lee        4     100
others cho        7     300

In [106]:
df=pd.DataFrame({'id':[1,2,10,20,100,200], 'name':['aa','aa2','aa3','aa4','aa5','aa6']})
df['id2']=df['id'].astype(str).apply(lambda x: x.zfill(5))
df['id2']

0    00001
1    00002
2    00010
3    00020
4    00100
5    00200
Name: id2, dtype: object